{
  "home": {
    "mainImage":"assets/images/home-bg.png",
    "profileName":"Gaurav Nadkarni",
    "skills":[
      "Fullstack Developer",
      "Beckend Developer"
    ]
  },
  "about": {
    "aboutBox": {
      "name": "Gaurav Nadkarni",
      "email": "nadkarnigaurav@gmail.com",
      "phone": "+91 (895) 133 5234",
      "profile": "Fullstack Developer",
      "image": {
        "src": "assets/images/profile-pic.png",
        "altText": "Gaurav"
      },
      "skills": [
        {
          "name": "Nodejs",
          "weightText": "8/10",
          "weightAmount": 80
        },
        {
          "name": "JavaScript",
          "weightText": "8/10",
          "weightAmount": 80
        },
        {
          "name": "React",
          "weightText": "7/10",
          "weightAmount": 70
        },
        {
          "name": "Database",
          "weightText": "8/10",
          "weightAmount": 80
        },
        {
          "name": "Backend",
          "weightText": "8/10",
          "weightAmount": 80
        },
        {
          "name": "Frontend",
          "weightText": "7/10",
          "weightAmount": 70
        }
      ],
      "aboutMe":[{
        "paragraph":"With over a decade of experience in software development, I have honed my skills across various technology stacks. My expertise lies in full-stack development, with a particular focus on backend-heavy solutions. Throughout my career, I have consistently delivered high-quality products to customers, ensuring that their needs are met with precision and care."
      },{
        "paragraph":"In addition to full-stack development, I have experience working with databases, cloud technologies, and real-time systems, all while managing to meet tight deadlines. My ability to adapt to different roles has been a key asset—I've thrived as a collaborator, a lone contributor, and a team leader. These experiences have provided me with unique perspectives on the software development process, allowing me to approach challenges from multiple standpoints."
      },{
        "paragraph":"I am confident in my ability to apply the lessons I've learned over the years to carry out my responsibilities efficiently and deliver quality results. As I look to the future, I am excited to apply my expertise to solving new problems and making a positive impact in the world."
      }]
    }
  },
  "skill": {
    "skillsBox": {
      "skills": [
        {
          "caption": "JavaScript",
          "color": "primary"
        },
        {
          "caption": "TypeScript",
          "color": "primary"
        },
        {
          "caption": "Node.js",
          "color": "primary"
        },
        {
          "caption": "React",
          "color": "primary"
        },
        {
          "caption": "HTML/CSS",
          "color": "primary"
        },
        {
          "caption": "MySQL/PostgreSQL",
          "color": "primary"
        },
        {
          "caption": "MongoDB",
          "color": "primary"
        },
        {
          "caption": "AWS/Azure",
          "color": "primary"
        },
        {
          "caption": "Integrations",
          "color": "primary"
        },
        {
          "caption": "Web Development",
          "color": "primary"
        },
        {
          "caption": "Backend Development",
          "color": "primary"
        },
        {
          "caption": "NestJS",
          "color": "primary"
        },
        {
          "caption": "express.JS",
          "color": "primary"
        },
        {
          "caption": "Redis",
          "color": "primary"
        },
        {
          "caption": "RabbitMQ/SQS",
          "color": "primary"
        },
        {
          "caption": "Serverless",
          "color": "primary"
        },
        {
          "caption": "git",
          "color": "primary"
        },
        {
          "caption": "JIRA",
          "color": "primary"
        },
        {
          "caption": "JAVA",
          "color": "info"
        },
        {
          "caption": "Php",
          "color": "info"
        }
      ]
    }
  },
  "projects": {
    "projectsBox": {
      "projects": [{
        "image":"/assets/images/cdt.jpg",
        "shortTitle":"Castle, Doors & Treasure",
        "shortDescription":"I created this game for a hackathon I participated in. The objective is to advance through the doors at each level of a castle, facing either a monster or discovering the treasure.",
        "longTitle":"Castle, Doors & Treasure",
        "longDescription":[
          "This is an exciting adventure game designed to challenge players through four main components: Doors, Levels, Castles, and Treasures. Each level features a series of closed doors, behind which lie various hidden objects. As players navigate through multiple levels within each castle, they face the thrill of discovery and the potential for peril.",
          "The objective is simple: click on the doors to reveal their contents. Players may uncover a passage to the next level or encounter a monster that ends their game. Successfully finding a pass allows players to advance through each door, leading them closer to the treasures waiting at the end of every castle. Along the way, players earn points for progressing through levels, with additional lives and bonuses hidden behind the doors for those daring enough to explore."
        ],
        "type": "public",
        "tech":[{
          "link":"https://clerk.com/",
          "name": "Clerk Auth"
        },{
          "link":"https://openai.com/index/chatgpt/",
          "name": "ChatGPT"
        },{
          "link":"https://openai.com/index/dall-e/",
          "name": "DALLE"
        },{
          "link":"https://nextjs.org/",
          "name": "NEXT.JS"
        },{
          "link":"https://www.convex.dev/",
          "name": "Convex"
        }],
        "links":[{
          "link":"https://github.com/gauravnadkarni/castle-doors-treasure",
          "iconText": "GITHUB"
        },{
          "link":"https://www.youtube.com/watch?v=VE-W_RRrAV4",
          "iconText": "YOUTUBE"
        },{
          "iconText": "INFO"
        }]
      },{
        "image":"",
        "shortTitle":"EMS",
        "shortDescription":"EMS is an app designed for viewers of a TV game show to answer questions and win prizes using their mobile devices. The primary goal was to enhance viewer engagement with the show.",
        "longTitle":"Experience Management System",
        "longDescription":[
          "This application was designed for a game show hosted on a television channel. The main idea behind the app was to engage viewers and encourage interaction with the show.",
          "The format of the game show was similar to \"Who Wants to Be a Millionaire\" where the host asked a series of questions to the contestant, and they could win money by answering correctly. Meanwhile, viewers could also play the game on their mobile devices, allowing them to feel as if they were part of the TV show.",
          "They could answer the same questions as those on TV and earn reward points for their participation, which they could later redeem. There was also a feature allowing players to view their rankings and see how their points compared to those of other players.",
          "The highlight of this app was that it could support around a million concurrent connections"
        ],
        "type": "private",
        "tech":[{
          "link":"https://www.typescriptlang.org/",
          "name": "TypeScript"
        },{
          "link":"https://nodejs.org/",
          "name": "Node.js"
        },{
          "link":"https://www.mysql.com/",
          "name": "MySQL"
        },{
          "link":"https://socket.io/",
          "name": "Socket.IO"
        },{
          "link":"https://redis.io/",
          "name": "Redis"
        },{
          "link":"https://aws.amazon.com/",
          "name": "AWS"
        }],
        "links":[{
          "iconText": "INFO"
        }]
      },{
        "image":"",
        "shortTitle":"Atlassian App",
        "shortDescription":"I was a Part of the team which designed the Jira-servicenow app connector which could push the data from customer's Jira cloud instance to Servicenow instance",
        "longTitle":"Jira Servicenow Connector App",
        "longDescription":[
          "This app is designed for seamless integration in the cloud. This app empowers users to effortlessly push data from Jira Cloud to their ServiceNow instance as updates are made.",
          "Users have complete control over the data transfer process, enabling them to specify exactly which Jira data gets sent to ServiceNow and in which fields that data is placed. The app offers custom configurations, allowing for precise field mappings between Jira and ServiceNow, ensuring that data is organized exactly as needed.",
          "This connector not only facilitates the data transfer but also handles any necessary transformations required during the process. This ensures a smooth and efficient integration experience, enhancing productivity and streamlining workflows between these two powerful platforms."
        ],
        "type": "private",
        "tech":[{
          "link":"https://www.google.com/search?q=JavaScript",
          "name": "JavaScript"
        },{
          "link":"https://jquery.com/",
          "name": "Jquery"
        },{
          "link":"https://nodejs.org/",
          "name": "Node.js"
        },{
          "link":"https://www.postgresql.org/",
          "name": "PostgreSQL"
        }],
        "links":[{
          "iconText": "INFO"
        }]
      },{
        "image":"",
        "shortTitle":"Recruitment Platform",
        "shortDescription":"The app coveres all hiring needs for organizations of all sizes. It supports virtual career fairs and recruitment sessions, ranging from a few hours to several weeks.",
        "longTitle":"Career fair and Recruitment Platform",
        "longDescription":[
          "The application addresses the comprehensive hiring needs of organizations of all sizes. It supports virtual career fairs and recruitment sessions that can last from a few hours to several weeks.",
          "With this app, users can easily group candidates, send emails, and access resumes. Inviting candidates and hiring managers to virtual career fairs or recruitment sessions can be done with just a few clicks. Additionally, interviewers have the ability to set their availability, allowing candidates to schedule interviews based on the interviewers' time slots."
        ],
        "type": "private",
        "tech":[{
          "link":"https://www.google.com/search?q=JavaScript",
          "name": "JavaScript"
        },{
          "link":"https://react.dev/",
          "name": "React"
        },{
          "link":"https://nodejs.org/",
          "name": "Node.js"
        },{
          "link":"https://expressjs.com/",
          "name": "Express.js"
        },{
          "link":"https://mui.com/",
          "name": "MUI"
        }],
        "links":[{
          "iconText": "INFO"
        }]
      },{
        "image":"",
        "shortTitle":"Ecommerce Product",
        "shortDescription":"This is an app to manage ecommerce business for SMEs. It supports business transactions using Open Banking standards, product inventory and Multichannel Order Management.",
        "longTitle":"Ecommerce Product",
        "longDescription":[
          "Open Banking platform that empowers organizations of all sizes to integrate seamless payment solutions and access financial data. With its innovative customer-facing portal, merchants can adopt Open Banking technologies, providing their end-users with alternative and secure payment options. This capability is designed to streamline financial transactions, enhancing user experience and operational efficiency.",
          "The platform features a low-level API for direct banking integrations, catering to businesses with technical expertise seeking maximum customization. This API allows companies to maintain raw communication channels with banks while leveraging the platform's capabilities for enhanced functionality.",
          "The focus is on automating instant bank payments and offering detailed banking data through its Business and Partners portals makes it a versatile solution for a variety of use cases. Whether you're a merchant looking to improve payment processes or a partner wishing to offer Open Banking integrations to your customers, the platform provides the tools necessary for a successful and efficient integration"
        ],
        "type": "private",
        "tech":[{
          "link":"https://www.typescriptlang.org/",
          "name": "TypeScript"
        },{
          "link":"https://react.dev/",
          "name": "React"
        },{
          "link":"https://nodejs.org/",
          "name": "Node.js"
        },{
          "link":"https://aws.amazon.com/",
          "name": "AWS"
        },{
          "link":"https://www.postgresql.org/",
          "name": "PostgreSQL"
        },{
          "link":"https://www.mongodb.com/",
          "name": "MongoDB"
        }],
        "links":[{
          "iconText": "INFO"
        }]
      },{
        "image":"",
        "shortTitle":"Cloudbased Saas Solution",
        "shortDescription":"This cloud-based Saas application is a vital tool designed to assist healthcare providers and emergency managers during an event of natural calamities or disasters.",
        "longTitle":"Cloudbased Saas Healthcare Solution for Disaster Management",
        "longDescription":[
          "This is a vital tool designed to assist healthcare providers and emergency managers during disasters. This cloud-based platform allows for the secure sharing of critical patient information, particularly for vulnerable populations, such as those on life support or with special needs.",
          "It enables both inpatient and outpatient facilities to update patient data in real time, ensuring that local emergency services can plan and respond effectively. This proactive approach to disaster management has been tested in real-life scenarios, proving its effectiveness in enhancing patient safety and care during emergencies."
        ],
        "type": "private",
        "tech":[{
          "link":"https://www.google.com/search?q=JavaScript",
          "name": "JavaScript"
        },{
          "link":"https://www.php.net/",
          "name": "PHP"
        },{
          "link":"https://jquery.com/",
          "name": "jQuery"
        },{
          "link":"https://www.mysql.com/",
          "name": "MySQL"
        },{
          "link":"https://aws.amazon.com/",
          "name": "AWS"
        }],
        "links":[{
          "iconText": "INFO"
        }]
      }]
    }
  },
  "workHistory": {
    "workItemsBox": {
      "workItems": [
        {
          "type": "Work",
          "oppText": "2023",
          "mainText": "Fena.co",
          "subText": "Consultant(remote)",
          "smallText": "London, UK",
          "dotColor": "primary",
          "dotTooltipText": "II was working as a contract employee for this organization and implemented the integration for OpenCart using the third party integration apis. I was also involved in suggesting improvements in their process, tech-stack and implementations.",
          "tooltipPlacement": "right"
        },
        {
          "type": "Certification",
          "oppText": "2021",
          "mainText": "Product, Customer Success & Workflow Badges",
          "subText": "monday.com Certifications",
          "smallText": "",
          "dotColor": "info",
          "dotTooltipText": "Earned monday.com certifications",
          "tooltipPlacement": "left"
        },
        {
          "type": "Certification",
          "oppText": "2020",
          "mainText": "ACP-600 & ACP-620",
          "subText": "Atlassian Certifications",
          "smallText": "",
          "dotColor": "info",
          "dotTooltipText": "Earned Atlassian certifications",
          "tooltipPlacement": "right"
        },
        {
          "type": "Work",
          "oppText": "2019",
          "mainText": "Empyra Software Solutions",
          "subText": "Tech Lead",
          "smallText": "Bangalore, India",
          "dotColor": "primary",
          "dotTooltipText": "I was Hired as a tech lead over here and my main responsibility was to guide the team technically on the project and to mentor junior developers. There were many project which I used to work on simultaneously. I was also involved in calls for collecting client requirements and to propose over all architectures for implementation, guide the implementation aiding wherever required and giving the clients demos and updates.",
          "tooltipPlacement": "left"
        },
        {
          "type": "Work",
          "oppText": "2019",
          "mainText": "Rakutan India Pvt Ltd",
          "subText": "Senior Software Engineer",
          "smallText": "Bangalore, India",
          "dotColor": "primary",
          "dotTooltipText": "I was hired as a senior software engineer over here Role: Support a CMS developed in Wordpress which was supposed to go to production in a months time.",
          "tooltipPlacement": "right"
        },
        {
          "type": "Work",
          "oppText": "2018",
          "mainText": "Sourcebits Pvt Ltd",
          "subText": "Associate Tech Lead",
          "smallText": "Bangalore, India",
          "dotColor": "primary",
          "dotTooltipText": "I was Hired as a Associate tech lead over here and my main responsibility was to guide the team technically on the project and to mentor junior developers.",
          "tooltipPlacement": "left"
        },
        {
          "type": "Work",
          "oppText": "2014",
          "mainText": "Nalashaa Solutions Pvt Ltd",
          "subText": "Senior Software Engineer",
          "smallText": "Bangalore, India",
          "dotColor": "primary",
          "dotTooltipText": "Initially I worked over here as a Software Engineer but later was promoted to Senior software engineer. Here are mostly worked with the US clients where I was the only technical person working from India and coordinating with tech lead and manager from US.",
          "tooltipPlacement": "right"
        },
        {
          "type": "Work",
          "oppText": "2012",
          "mainText": "Stridus Infotech Pvt ltd",
          "subText": "Software Engineer",
          "smallText": "Bangalore, India",
          "dotColor": "primary",
          "dotTooltipText": "I worked as a developer in a team of 10 members. reporting to a technical manager who was onsite in US. I worked on a couple of projects during my time here.",
          "tooltipPlacement": "left"
        },
        {
          "type": "Certification",
          "oppText": "2011",
          "mainText": "OCJP 1.6",
          "subText": "Oracle Certification",
          "smallText": "",
          "dotColor": "info",
          "dotTooltipText": "Earned the Oracle certified Java Professional 1.6 certification",
          "tooltipPlacement": "right"
        },
        {
          "type": "Course",
          "oppText": "2011",
          "mainText": "Programing Courses",
          "subText": "Seed Infotech",
          "smallText": "Pune, India",
          "dotColor": "info",
          "dotTooltipText": "Completed Java, J2EE, spring and Hibernate courses from the institute",
          "tooltipPlacement": "left"
        },
        {
          "type": "Work",
          "oppText": "2010",
          "mainText": "Nanu Engineers Pvt Ltd (India)",
          "subText": "System Admin",
          "smallText": "Goa, India",
          "dotColor": "primary",
          "dotTooltipText": "I was responsible for managing the computer networks of the organization, as well as maintaining the software on our systems. Our infrastructure included an MS Exchange on-premises server, a Windows server, and a mix of Windows and Linux machines. A key achievement in this role was installing Linux machines and successfully integrating them with the Windows server. This allowed users to access the ERP systems hosted on the Windows server with different user accounts, thereby saving the organization from purchasing additional Windows licenses.",
          "tooltipPlacement": "right"
        },
        {
          "type": "Study",
          "oppText": "2008",
          "mainText": "Bachelor of Engineering(IT)",
          "subText": "Goa University",
          "smallText": "Goa, India",
          "dotColor": "info",
          "dotTooltipText": "Completed BE in information technology",
          "tooltipPlacement": "left"
        }
      ]
    }
  },
  "resume": {
    "resumeBox": {
      "path": "https://drive.google.com/file/d/1pEzLQeLBEXcPwhpsmCm9ixTNcO8Y-x8Z/view?usp=drive_link"
    }
  },
  "blogs": {

  },
  "footer": {
    "contactBox": {
      "physicalAddresses": [
        {
          "caption": "Address",
          "value": "Goa, India - 403706",
          "icon": "ADDRESS"
        },
        {
          "caption": "Phone",
          "value": "+91 (895) 133 5234",
          "icon": "PHONE"
        },
        {
          "caption": "Email",
          "value": "nadkarnigaurav@gmail.com",
          "icon": "EMAIL"
        }
      ],
      "socialLinks": [
        {
          "link": "https://www.linkedin.com/in/gauravnadkarni/",
          "icon": "LINKEDIN"
        },
        {
          "link": "https://github.com/gauravnadkarni",
          "icon": "GITHUB"
        }
      ]
    }
  }
}
